In [26]:
import numpy as np
np.random.randn(5)

array([ 0.99330253,  0.20888367, -0.31041631,  1.05809261, -1.29736681])

In [27]:
np1 = np.array([1, 2, 3])
np2 = np.array([3, 4, 5])
print(np1)
print(np1.ndim, np1.shape, np1.dtype)

[1 2 3]
1 (3,) int32

In [28]:
np3 = np.array([1, 2, 3, 4, 5, 6])
np3 = np3.reshape([2, 3])
print(np3.ndim, np3.shape, np3.dtype) # 2 (2, 3) int64

2 (2, 3) int32

npd = np.genfromtxt('data.csv', delimiter=',')
以上介紹了 Numpy 的基礎知識，建立了基本的 array 和 ndarray 的觀念。
相信在熟悉 Numpy 之後 Pandas 的學習將會比較容易 
（Pandas 的資料容器 DataFrame、Series 事實上是奠基在 Numpy 的陣列上）

pandas分隔線----------------------------------------------------

In [12]:
import pandas as pd
my_obj = pd.Series([4, 7, -5, 3])
my_obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [13]:
my_obj.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
my_obj2 = pd.Series([8,9,10,11], index=['a','b','c','d'])
my_obj2

a     8
b     9
c    10
d    11
dtype: int64

In [15]:
my_obj2['a']

8

在pandas裡面，series和index就很像所謂"python裡面的key-value" 所以我們也可以將dictionary匯入series的架構中

In [18]:
dic_data = {'name':'apple','birthday':'1996-1-1','luckynumber':7 }
my_obj3 = pd.Series(dic_data)
my_obj3

name              apple
birthday       1996-1-1
luckynumber           7
dtype: object

series是一維架構，DataFrame就像EXCEL有index和column，可以透過index和column來找到我們要的某一筆資料。
https://ithelp.ithome.com.tw/articles/10193421

In [25]:
data = {'name': ['Bob', 'Nancy','Amy','Elsa','Jack'],
        'year': [1996, 1997, 1997, 1996, 1997],
        'month': [8, 8, 7, 1, 12],
        'day':[11,23,8,3,11]}
myframe = pd.DataFrame(data)
myframe

    name  year  month  day
0    Bob  1996      8   11
1  Nancy  1997      8   23
2    Amy  1997      7    8
3   Elsa  1996      1    3
4   Jack  1997     12   11

In [24]:
data

{'name': ['Bob', 'Nancy', 'Amy', 'Elsa', 'Jack'],
 'year': [1996, 1997, 1997, 1996, 1997],
 'month': [8, 8, 7, 1, 12],
 'day': [11, 23, 8, 3, 11]}

In [29]:
df = pd.read_csv('test.csv')
df.head()

   1  2  3  4   5   6   7   8   9
0  2  3  4  5   6   7   8   9  10
1  3  4  5  6   7   8   9  10  11
2  4  5  6  7   8   9  10  11  12
3  5  6  7  8   9  10  11  12  13
4  6  7  8  9  10  11  12  13  14

In [30]:
df.tail()

     1   2   3   4   5   6   7   8   9
12  14  15  16  17  18  19  20  21  22
13  15  16  17  18  19  20  21  22  23
14  16  17  18  19  20  21  22  23  24
15  17  18  19  20  21  22  23  24  25
16  18  19  20  21  22  23  24  25  26

2.  pd.options.display.max_columns = 999  
这个是DataFrame被输出的时候，如果列数太多，中间的列会被省略，而这个设置后最后可以显示999列